src/test/resources/Emulation_Input/RedeemRequest.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:ns="http://www.xmlns.walmartstores.com/DemandChain/OfferServices/datatypes/RedeemOffers/1.0/"
	xmlns:ns1="http://www.xmlns.walmartstores.com/Header/datatypes/MessageHeader/1.4/">
	<soapenv:Header>
		<wsse:Security soapenv:mustUnderstand="1"
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsse:UsernameToken>
				<wsse:Username>MESPROD</wsse:Username>
				<wsse:Password>RErahin6K</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</soapenv:Header>
	<soapenv:Body>
		<ns:redeemOffersRequest>
			<ns:messageHeader>
				<ns1:SubId>S[B@199e199e</ns1:SubId>
				<ns1:CnsmrId>C[B@7bdd7bdd</ns1:CnsmrId>
				<ns1:SrvcNm>RedeemOffers.RedeemOffers</ns1:SrvcNm>
				<!--Optional:-->
				<ns1:AppId>InstantSavings</ns1:AppId>
				<!--Optional:-->
				<ns1:SrcSysId>POS</ns1:SrcSysId>
				<ns1:Version>1.0</ns1:Version>
			</ns:messageHeader>
			<ns:messageBody>
				<ns:accessToken>
					<ns:id>1234</ns:id>
				</ns:accessToken>
				<ns:channel>
					<ns:code>1</ns:code>
					<ns:name>POS</ns:name>
				</ns:channel>
				<ns:customerOrder>
					<ns:customer>
						<ns:id>1010010504980939</ns:id>
					</ns:customer>
					<ns:salesTransaction>
						<ns:transactionCode>111</ns:transactionCode>
						<ns:txTime>2017-04-14T00:46:43</ns:txTime>
						<ns:businessUnit>
							<ns:number>4969</ns:number>
							<ns:location>
								<ns:countryCode>US</ns:countryCode>
							</ns:location>
							<ns:businessUnitType>
								<ns:code>01</ns:code>
								<ns:terminal>
									<ns:terminalID>5432</ns:terminalID>
								</ns:terminal>
							</ns:businessUnitType>
						</ns:businessUnit>
					</ns:salesTransaction>
				</ns:customerOrder>
			</ns:messageBody>
		</ns:redeemOffersRequest>
	</soapenv:Body>
</soapenv:Envelope>